/**
    荷兰国旗问题：
        给一个数组arr，和一个数num，将数组中小于num的数全部放在左边，把数组中等于num的数放在中间，把数组中大于num的数放在右边。
    分三个区域：
    
        ++++++++++++++++++++++++++++++++++++++++++++++
        +   <区  |    =区   |   ···待定··· |    >区   +
        ++++++++++++++++++++++++++++++++++++++++++++++
         ^
         |
         |
         i
         
         
        1.小于区域：[i] < num, [i]和<区下一个交换，<区右扩，i++
        2.等于区域：[i] == num, i++
        3.大于区域：[i] > num, [i]和>区前一个交换，>区左扩，i不变
    停止条件是当下标i进入大于区域时循环停止。
    
/
#include <vector>

void partition() {
    
}

void quickSort() {
     
}
